#include <iostream>
using namespace std;
#include "MyString.h"


int main()
{
	//	Завдання
	//		Розробити клас String, який в подальшому будемо використовувати для роботи з рядками.Клас повинен містити :
	//	- Конструктор за замовчуванням, що дозволяє створити
	//		рядок довжиною 80 символів;
	//	- Конструктор, що дозволяє створювати рядок довільного розміру;
	//	- Конструктор, який створює рядок і ініціалізує його
	//		рядком, отриманим від користувача.
	//		Необхідно створити деструктор, а також використовувати механізми делегування конструкторів, якщо це
	//		можливо.
	//		Клас повинен містити методи для введення рядків з
	//		клавіатури і виведення рядків на екран.Також потрібно
	//		реалізувати статичну функцію - член, яка буде повертати
	//		кількість створених об’єктів рядків

	char* name = new char[6] {'H', 'e', 'l', 'l','o', '\0'};
	MyString str1;
	str1.print();

	MyString str2(name);
	str2.print();

	MyString str3;
	str3.input();
	str3.print();

	cout<<"Counter object: "<< str1.getCounterObject() << endl;




	return 0;
}